devdnl/dnx-rtos/src/system/drivers/ethmac/stm32f1/ethmac.c
                        if (__ETHMAC_CHECKSUM_BY_HARDWARE__ != 0) {
                                for (uint i = 0; i < NUMBER_OF_TX_BUFFERS; i++) {
                                        ETH_DMATxDescChecksumInsertionConfig(&ethmac->DMA_tx_descriptor[i],
                                                                             ETH_DMATxDesc_ChecksumTCPUDPICMPFull);
                                }
                        }

                        for (uint i = 0; i < NUMBER_OF_RX_BUFFERS; i++) {
                                ETH_DMARxDescReceiveITConfig(&ethmac->DMA_rx_descriptor[i], ENABLE);
                        }

                        return ESUCC;
                } else {
                        status = EIO;
                }
        }

        error:
        /* error occurred */
        if (device_handle)
                _sys_free(device_handle);

        if (rx_ready_sem)
                _sys_semaphore_delete(rx_ready_sem);

        if (rx_mtx)
                _sys_mutex_delete(rx_mtx);

        if (tx_mtx)
                _sys_mutex_delete(tx_mtx);

        return status;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_RELEASE(ETHMAC, void *device_handle)
{
        struct ethmac *hdl = device_handle;
        int            status;

        _sys_critical_section_begin();

        if (_sys_device_is_unlocked(&hdl->dev_lock)) {
                ETH_DeInit();
                NVIC_DisableIRQ(ETH_IRQn);
                CLEAR_BIT(RCC->AHBENR, RCC_AHBENR_ETHMACRXEN | RCC_AHBENR_ETHMACTXEN | RCC_AHBENR_ETHMACEN);
                ethmac = NULL;
                _sys_free(device_handle);

                status = ESUCC;
        } else {
                status = EBUSY;
        }

        _sys_critical_section_end();

        return status;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_OPEN(ETHMAC, void *device_handle, u32_t flags)
{
        UNUSED_ARG(flags);

        struct ethmac *hdl = device_handle;

        return (_sys_device_lock(&hdl->dev_lock) ? ESUCC : EBUSY);
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_CLOSE(ETHMAC, void *device_handle, bool force)
{
        struct ethmac *hdl = device_handle;

        if (_sys_device_is_access_granted(&hdl->dev_lock) || force) {
                _sys_device_unlock(&hdl->dev_lock, force);
                return ESUCC;
        } else {
                return EBUSY;
        }
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_WRITE(ETHMAC,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG(fpos);

        struct ethmac *hdl = device_handle;

        if (is_Ethernet_started()) {

                if (_sys_mutex_lock(hdl->tx_access, fattr.non_blocking_wr ? 0 : MAX_DELAY_MS)) {

                        *wrcnt = 0;
                        int status;

                        while (count) {
                                while (is_buffer_owned_by_DMA(DMATxDescToSet)) {

                                        if (fattr.non_blocking_wr) {
                                                status = EAGAIN;
                                                goto exit;
                                        }

                                        _sys_sleep_ms(1);
                                }

                                size_t packet_size = min(count, ETH_MAX_PACKET_SIZE);

                                u8_t *buffer = get_buffer_address(DMATxDescToSet);
                                memcpy(buffer, src, packet_size);
                                send_packet(count);

                                *wrcnt += packet_size;
                                count  -= packet_size;
                        }

                        status = ESUCC;

                        exit:
                        _sys_mutex_unlock(hdl->tx_access);

                        return status;
                } else {
                        return EAGAIN;
                }

        } else {
                return EIO;
        }
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_READ(ETHMAC,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG(fpos);

        struct ethmac *hdl = device_handle;

        if (is_Ethernet_started()) {
                if (count % ETH_MAX_PACKET_SIZE == 0) {

                        *rdcnt = 0;

                        if (_sys_mutex_lock(hdl->rx_access, fattr.non_blocking_rd ? 0 : MAX_DELAY_MS)) {
                                size_t pkts = count / ETH_MAX_PACKET_SIZE;
                                while (pkts--) {
                                        size_t pkt_size = wait_for_packet(hdl, fattr.non_blocking_rd ? 0 : MAX_DELAY_MS);
                                        if (pkt_size) {
                                                u8_t *src = get_buffer_address(DMARxDescToGet);

                                                memcpy(dst, src, min(pkt_size, count));
                                                give_Rx_buffer_to_DMA();
                                                make_Rx_buffer_available();

